package hello.core.discount;
import hello.core.member.Member;

//주문과 할인 도메인 설계

//주문과 할인 정책
// => 회원은 상품을 주문할 수 있다.
// => 회원 등급에 따라 할인 정책을 적용할 수 있다.
// => 할인 정책은 모든 VIP는 1000원을 할인해주는 고정 금액 할인을 적용해달라. (나중에 변경 될 수 있다.)
// => 할인 정책은 변경 가능성이 높다. 회사의 기본 할인 정책을 아직 정하지 못했고, 오픈 직전까지 고민을 미루고 싶다. 최악의 경우 할인을 적용하지 않을 수 도 있다. (미확정)

//주문 도메인 협력, 역할, 책임
// => 1. 주문 생성: 클라이언트는 '주문 서비스'에 주문 생성을 요청한다. (회원id, 상품명, 상품가격)
// => 2. 회원 조회(회원서비스): 할인을 위해서는 회원 등급이 필요하다. 그래서 '주문 서비스'는 회원 저장소에서 회원을 조회한다.
// => 3. 할인 적용(회원서비스): 주문 서비스는 회원 등급에 따른 할인 여부를 할인 정책에 위임한다.
// => 4. 주문 결과 반환: 주문 서비스는 할인 결과를 포함한 주문 결과를 반환한다.
// =>참고로 실제로는 주문 데이터를 DB에 저장하겠지만, 예제가 너무 복잡해 질 수 있어서 생략하고, 단순히 주문 결과를 반환한다.

//주문 도메인 전체
// => 역할과 구현을 분리해서 자유롭게 구현 객체를 조립할 수 있게 설계했다. 덕분에 회원 저장소는 물론이고, 할인 정책도 유연하게 변경할 수 있다.
// => 주문 도메인 클래스 다이어그램, 주문 도메인 객체 다이어그램1, 주문 도메인 객체 다이어그램2
// => 회원을 메모리에서 조회하고, 정액 할인 정책(고정 금액)을 지원해도 주문 서비스를 변경하지 않아도 된다. 역할들의 협력 관계를 그대로 재사용 할 수 있다.
// => 회원을 메모리가 아닌 실제 DB에서 조회하고, 정률 할인 정책(주문 금액에 따라 % 할인)을 지원해도 주문 서비스를 변경하지 않아도 된다. 협력 관계를 그대로 재사용 할 수 있다.

//[NEW] 새로운 할인 정책 개발
// => 새로운 할인 정책을 확장해보자.
// => 악덕 기획자: 서비스 오픈 직전에 할인 정책을 지금처럼 고정 금액 할인이 아니라 좀 더 합리적인 주문 금액당 할인하는 정률% 할인으로 변경하고 싶어요.
// => 예를 들어서 기존 정책은 VIP가 10000원을 주문하든 20000원을 주문하든 항상 1000원을 할인했는데,
// => 이번에 새로 나온 정책은 10%로 지정해두면 고객이 10000원 주문시 1000원을 할인해주고, 20000원 주문시에 2000원을 할인해주는 거에요!
// => 순진 개발자: 제가 처음부터 고정 금액 할인은 아니라고 했잖아요.
// => 악덕 기획자: 애자일 소프트웨어 개발 선언 몰라요? “계획을 따르기보다 변화에 대응하기를”
// => 순진 개발자: ... (하지만 난 유연한 설계가 가능하도록 객체지향 설계 원칙을 준수했지 후후)
// => 참고) 애자일 소프트웨어 개발 선언 https://agilemanifesto.org/iso/ko/manifesto.html
// => 순진 개발자가 정말 객체지향 설계 원칙을 잘 준수 했는지 확인해보자. 이번에는 주문한 금액의 %를 할인해주는 새로운 정률 할인 정책을 추가하자. - RateDiscountPolicy 추가

//새로운 할인 정책 적용과 문제점
// => 방금 추가한 할인 정책을 적용해보자. 할인 정책을 애플리케이션에 적용해보자. 할인 정책을 변경하려면 클라이언트인 OrderServiceImpl 코드를 고쳐야 한다
// => public class OrderServiceImpl implements OrderService {
//      //private final DiscountPolicy discountPolicy = new FixDiscountPolicy();
//      private final DiscountPolicy discountPolicy = new RateDiscountPolicy();
//  }

//문제점 발견
// => 우리는 역할과 구현을 충실하게 분리했다. OK / 다형성도 활용하고, 인터페이스와 구현 객체를 분리했다. OK
// => OCP, DIP 같은 객체지향 설계 원칙을 충실히 준수했다 - 그렇게 보이지만 사실은 아니다.
// => DIP: 주문서비스 클라이언트(OrderServiceImpl)는 DiscountPolicy 인터페이스에 의존하면서 DIP를 지킨 것 같은데?
// => 클래스 의존관계를 분석해 보자. 추상(인터페이스) 뿐만 아니라 구체(구현) 클래스에도 의존하고 있다.
// => [추상(인터페이스)의존: DiscountPolicy] [구체(구현) 클래스: FixDiscountPolicy , RateDiscountPolicy]
// => OCP: 변경하지 않고 확장할 수 있다고 했는데! 지금 코드는 기능을 확장해서 변경하면, 클라이언트 코드에 영향을 준다! 따라서 OCP를 위반한다.
// => 왜 클라이언트 코드를 변경해야 할까? 클래스 다이어그램으로 의존관계를 분석해보자.
// => 지금까지 단순히 DiscountPolicy 인터페이스만 의존한다고 생각했다. 하지만 잘보면 클라이언트인 OrderServiceImpl 이 DiscountPolicy 인터페이스 뿐만 아니라
// => FixDiscountPolicy 인 구체 클래스도 함께 의존하고 있다. 실제 코드를 보면 의존하고 있다! - DIP 위반
// => 그래서 FixDiscountPolicy 를 RateDiscountPolicy 로 변경하는 순간 OrderServiceImpl 의 소스 코드도 함께 변경해야 한다! - OCP 위반
// => 어떻게 문제를 해결할 수 있을가?
// => 클라이언트 코드인 OrderServiceImpl 은 DiscountPolicy 의 인터페이스 뿐만 아니라 구체 클래스도 함께 의존한다. 그래서 구체 클래스를 변경할 때 클라이언트 코드도 함께 변경해야 한다.
// => DIP 위반 -> 추상에만 의존하도록 변경(인터페이스에만 의존) : DIP를 위반하지 않도록 인터페이스에만 의존하도록 의존관계를 변경하면 된다.
// => public class OrderServiceImpl implements OrderService {
//      //private final DiscountPolicy discountPolicy = new RateDiscountPolicy();
//      private DiscountPolicy discountPolicy;
// }
// => 인터페이스에만 의존하도록 설계와 코드를 변경했다. 그런데 구현체가 없는데 어떻게 코드를 실행할 수 있을까? 실제 실행을 해보면 NPE(null pointer exception)가 발생한다.

//해결방안 : 관심사의 분리 - AppConfig등장
// => 이 문제를 해결하려면 누군가가 클라이언트인 OrderServiceImpl 에 DiscountPolicy 의 구현 객체를 대신 생성하고 주입해주어야 한다.
// => 애플리케이션을 하나의 공연이라 생각해보자. 각각의 인터페이스를 배역(배우 역할)이라 생각하자. 그런데! 실제 배역 맞는 배우를 선택하는 것은 누가 하는가?
// => 로미오와 줄리엣 공연을 하면 로미오 역할을 누가 할지 줄리엣 역할을 누가 할지는 배우들이 정하는게 아니다.
// => 이전 코드는 마치 로미오 역할(인터페이스)을 하는 레오나르도 디카프리오(구현체, 배우)가 줄리엣 역할(인터페이스)을 하는 여자 주인공(구현체, 배우)을 직접 초빙하는 것과 같다.
// => 디카프리오는 공연도 해야하고 동시에 여자 주인공도 공연에 직접 초빙해야 하는 다양한 책임을 가지고 있다. 관심사를 분리하자
// => 배우는 본인의 역할인 배역을 수행하는 것에만 집중해야 한다. 디카프리오는 어떤 여자 주인공이 선택되더라도 똑같이 공연을 할 수 있어야 한다.
// => 공연을 구성하고, 담당 배우를 섭외하고, 역할에 맞는 배우를 지정하는 책임을 담당하는 별도의 공연 기획자가 나올시점이다. 공연 기획자를 만들고, 배우와 공연 기획자의 책임을 확실히 분리하자.
// => AppConfig 등장 : 애플리케이션의 전체 동작 방식을 구성(config)하기 위해, 구현 객체를 생성하고, 연결하는 책임을 가지는 별도의 설정 클래스를 만들자. - AppConfig.java

//[NEW]새로운 구조와 할인 정책 적용
// => 처음으로 돌아가서 정액 할인 정책을 정률% 할인 정책으로 변경해보자. FixDiscountPolicy -> RateDiscountPolicy 어떤 부분만 변경하면 되겠는가?
// => AppConfig의 등장으로 애플리케이션이 크게 사용 영역과, 객체를 생성하고 구성(Configuration)하는 영역으로 분리되었다.
// => 그림 - [사용,구성의 분리, 할인 정책의 변경] : FixDiscountPolicy => RateDiscountPolicy 로 변경해도 구성 영역만 영향을 받고, 사용 영역은 전혀 영향을 받지 않는다.
// => AppConfig 변경 코드 추가 : 이제 할인 정책을 변경해도, 애플리케이션의 구성 역할을 담당하는 AppConfig만 변경하면 된다.
// => 클라이언트 코드인 OrderServiceImpl 를 포함해서 사용 영역의 어떤 코드도 변경할 필요가 없다.
// => 구성 영역은 당연히 변경된다. 구성 역할을 담당하는 AppConfig를 애플리케이션이라는 공연의 기획자로 생각하자.
// => 공연 기획자는 공연 참여자인 구현 객체들을 모두 알아야 한다.

//전체 흐름 정리
// => 새로운 할인 정책 개발 >> 새로운 할인 정책 적용과 문제점 관심사의 분리 >> AppConfig 리팩터링 >> 새로운 구조와 할인 정책 적용
// => 1. 새로운 할인 정책 개발 : 다형성 덕분에 새로운 정률 할인 정책 코드를 추가로 개발하는 것 자체는 아무 문제가 없음
// => 2. 새로운 할인 정책 적용과 문제점 : 새로 개발한 정률 할인 정책을 적용하려고 하니 클라이언트 코드인 주문 서비스 구현체도 함께 변경해야함 주문 서비스 클라이언트가 인터페이스인 DiscountPolicy 뿐만 아니라, 구체 클래스인 FixDiscountPolicy 도 함께 의존 DIP 위반
// => 3. 관심사의 분리 : 애플리케이션을 하나의 공연으로 생각, 기존에는 클라이언트가 의존하는 서버 구현 객체를 직접 생성하고 실행함, 비유를 하면 기존에는 남자 주인공 배우가 공연도 하고, 동시에 여자 주인공도 직접 초빙하는 다양한 책임을 가지고 있음
// => 공연을 구성하고, 담당 배우를 섭외하고, 지정하는 책임을 담당하는 별도의 공연 기획자가 나올 시점 공연 기획자인 AppConfig가 등장, AppConfig는 애플리케이션의 전체 동작 방식을 구성(config)하기 위해, 구현 객체를 생성하고, 연결하는 책임
// => 이제부터 클라이언트 객체는 자신의 역할을 실행하는 것만 집중, 권한이 줄어듬(책임이 명확해짐)
// => 4. AppConfig 리팩터링 : 구성 정보에서 역할과 구현을 명확하게 분리, 역할이 잘 드러남, 중복 제거
// => 5. 새로운 구조와 할인 정책 적용 : 정액 할인 정책 -> 정률% 할인 정책으로 변경, AppConfig의 등장으로 애플리케이션이 크게 사용 영역과 객체를 생성하고 구성(Configuration)하는 영역으로 분리
//=> 할인 정책을 변경해도 AppConfig가 있는 구성 영역만 변경하면 됨, 사용 영역은 변경할 필요가 없음. 물론 클라이언트 코드인 주문 서비스 코드도 변경하지 않음

// 좋은 객체 지향 설계의 5가지 원칙의 적용
// => 여기서 3가지 SRP, DIP, OCP 적용
// => 1. SRP 단일 책임 원칙 : 한 클래스는 하나의 책임만 가져야 한다.
// => 클라이언트 객체는 직접 구현 객체를 생성하고, 연결하고, 실행하는 다양한 책임을 가지고 있음 SRP 단일 책임 원칙을 따르면서 관심사를 분리함
// => 구현 객체를 생성하고 연결하는 책임은 AppConfig가 담당, 클라이언트 객체는 실행하는 책임만 담당
// => 2. DIP 의존관계 역전 원칙 : 프로그래머는 “추상화에 의존해야지, 구체화에 의존하면 안된다.” 의존성 주입은 이 원칙을 따르는 방법 중 하나다.
// => 새로운 할인 정책을 개발하고, 적용하려고 하니 클라이언트 코드도 함께 변경해야 했다. 왜냐하면 기존 클라이언트 코드( OrderServiceImpl )는 DIP를 지키며 DiscountPolicy 추상화 인터페이스에 의존하는 것 같았지만, FixDiscountPolicy 구체화 구현 클래스에도 함께 의존했다.
// => 클라이언트 코드가 DiscountPolicy 추상화 인터페이스에만 의존하도록 코드를 변경했다. 하지만 클라이언트 코드는 인터페이스만으로는 아무것도 실행할 수 없다. AppConfig가 FixDiscountPolicy 객체 인스턴스를 클라이언트 코드 대신 생성해서 클라이언트 코드에 의존관계를 주입했다. 이렇게해서 DIP 원칙을 따르면서 문제도 해결했다.
// => 3. OCP : 소프트웨어 요소는 확장에는 열려 있으나 변경에는 닫혀 있어야 한다
// => 다형성 사용하고 클라이언트가 DIP를 지킴 , 애플리케이션을 사용 영역과 구성 영역으로 나눔, AppConfig가 의존관계를 FixDiscountPolicy RateDiscountPolicy 로 변경해서 클라이언트 코드에 주입하므로 클라이언트 코드는 변경하지 않아도 됨, 소프트웨어 요소를 새롭게 확장해도 사용 영역의 변경은 닫혀 있다!

// IoC, DI, 그리고 컨테이너
//제어의 역전 IoC(Inversion of Control)
// => 기존 프로그램은 클라이언트 구현 객체가 스스로 필요한 서버 구현 객체를 생성하고, 연결하고, 실행했다. 한마디로 구현 객체가 프로그램의 제어 흐름을 스스로 조종했다. 개발자 입장에서는 자연스러운 흐름이다.
// => 반면에 AppConfig가 등장한 이후에 구현 객체는 자신의 로직을 실행하는 역할만 담당한다. 프로그램의 제어 흐름은 이제 AppConfig가 가져간다. 예를 들어서 OrderServiceImpl 은 필요한 인터페이스들을 호출하지만 어떤 구현 객체들이 실행될지 모른다.
// => 프로그램에 대한 제어 흐름에 대한 권한은 모두 AppConfig가 가지고 있다. 심지어 OrderServiceImpl 도 AppConfig가 생성한다. 그리고 AppConfig는 OrderServiceImpl 이 아닌 OrderService 인터페이스의 다른 구현 객체를 생성하고 실행할 수 도 있다.
// => 그런 사실도 모른체 OrderServiceImpl 은 묵묵히 자신의 로직을 실행할 뿐이다. 이렇듯 프로그램의 제어 흐름을 직접 제어하는 것이 아니라 외부에서 관리하는 것을 제어의 역전(IoC)이라 한다.
// => 프레임워크 vs 라이브러리 : 프레임워크가 내가 작성한 코드를 제어하고, 대신 실행하면 그것은 프레임워크가 맞다.(JUnit), 반면에 내가 작성한 코드가 직접 제어의 흐름을 담당한다면 그것은 프레임워크가 아니라 라이브러리다.

//의존관계 주입 DI(Dependency Injection)
// => OrderServiceImpl 은 DiscountPolicy 인터페이스에 의존한다. 실제 어떤 구현 객체가 사용될지는 모른다. 의존관계는 정적인 클래스 의존 관계와, 실행 시점에 결정되는 동적인 객체(인스턴스) 의존 관계 둘을 분리해서 생각해야 한다.
// => 정적인 클래스 의존관계
// => 클래스가 사용하는 import 코드만 보고 의존관계를 쉽게 판단할 수 있다. 정적인 의존관계는 애플리케이션을 실행하지 않아도 분석할 수 있다.
// => 클래스 다이어그램을 보자 : OrderServiceImpl 은 MemberRepository , DiscountPolicy 에 의존한다는 것을 알 수 있다. 그런데 이러한 클래스 의존관계 만으로는 실제 어떤 객체가 OrderServiceImpl 에 주입 될지 알 수 없다.
// => 동적인 객체 인스턴스 의존 관계
// => 애플리케이션 실행 시점에 실제 생성된 객체 인스턴스의 참조가 연결된 의존 관계다. 애플리케이션 실행 시점(런타임)에 외부에서 실제 구현 객체를 생성하고 클라이언트에 전달해서 클라이언트와 서버의 실제 의존관계가 연결 되는 것을 의존관계 주입이라 한다.
// => 객체 인스턴스를 생성하고, 그 참조값을 전달해서 연결된다. 의존관계 주입을 사용하면 클라이언트 코드를 변경하지 않고, 클라이언트가 호출하는 대상의 타입 인스턴스를 변경할 수 있다. 의존관계 주입을 사용하면 정적인 클래스 의존관계를 변경하지 않고, 동적인 객체 인스턴스 의존관계를 쉽게 변경할 수 있다.

//IoC 컨테이너, DI 컨테이너
// => AppConfig 처럼 객체를 생성하고 관리하면서 의존관계를 연결해 주는 것을 IoC 컨테이너 또는 DI 컨테이너라 한다.
// => 의존관계 주입에 초점을 맞추어 최근에는 주로 DI 컨테이너라 한다. 또는 어샘블러, 오브젝트 팩토리 등으로 불리기도 한다.

//스프링으로 전환하기
// => 지금까지 순수한 자바 코드만으로 DI를 적용했다. 이제 스프링을 사용해보자. 지금은 코드만 작성하고 설명은 마지막에 하겠다.
// => step1.AppConfig를 스프링 기반으로 변경 : AppConfig에 설정을 구성한다는 뜻의 @Configuration 을 붙여준다. 각 메서드에 @Bean 을 붙여준다. 이렇게 하면 스프링 컨테이너에 스프링 빈으로 등록한다.
// => step2.MemberApp에 스프링 컨테이너 적용, OrderApp에 스프링 컨테이너 적용
// => 두 코드를 실행하면 스프링 관련 로그가 몇줄 실행되면서 기존과 동일한 결과가 출력된다.


//주문과 할인 도메인 개발 - 할인 정책 인터페이스
public interface DiscountPolicy {
    /**
     * @return 할인 대상 금액
     */
    int discount(Member member, int price);
}